.config/doom/config.org
#+TITLE: Doom Emacs Config
#+AUTHOR: Andrea Esposito
#+PROPERTY: header-args :tangle yes :comments both

* Table of Contents :TOC:
- [[#introduction][Introduction]]
- [[#basic-variables-and-configs][Basic Variables and Configs]]
  - [[#themes][Themes]]
  - [[#fix-evil-mode-navigation][Fix EVIL mode navigation]]
- [[#org-mode][Org Mode]]
  - [[#allowing-citations][Allowing Citations]]
  - [[#latex-export][LaTeX Export]]
  - [[#org-mode-babel][Org-Mode Babel]]
  - [[#org-capture-templates][Org Capture Templates]]
  - [[#writing-letters][Writing Letters]]
- [[#additional-stuff][Additional Stuff]]
- [[#mail-mu4e][Mail (mu4e)]]
  - [[#using-org-mode][Using Org-Mode]]
  - [[#accounts-setup][Accounts Setup]]
- [[#telegram][Telegram]]
- [[#olivetti-mode][Olivetti mode]]
- [[#screenwriting-fountain-mode][Screenwriting (=fountain-mode=)]]
- [[#latex][LaTeX]]
- [[#python][Python]]
  - [[#ruff-and-ruff-language-server][Ruff and Ruff Language Server]]

* Introduction
#+BEGIN_INFO
The content of this documentation comes directly from Doom Emacs' default configuration's comments.
#+END_INFO

#+BEGIN_SRC elisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+END_SRC

This is, instead, the original documentation of Doom Emacs =packages.el= file.

#+BEGIN_SRC elisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;; (package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/radian-software/straight.el#the-recipe-format
;; (package! another-package
;;   :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;; (package! this-package
;;   :recipe (:host github :repo "username/repo"
;;            :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;; (package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;; (package! builtin-package :recipe (:nonrecursive t))
;; (package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see radian-software/straight.el#279)
;; (package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;; (package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;; (unpin! pinned-package)
;; ...or multiple packages
;; (unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;; (unpin! t)
;(package! smart-tabs-mode)
;(package! company-posframe)
#+END_SRC


* Basic Variables and Configs
Place your private configuration here! Remember, you do not need to run 'doom
sync' after modifying this file!

The following line can be used on macOS to remove the title bar and make the
application window "rounded" (as other macOS apps). This looks especially good
if used with tiling window managers (e.g., yabai).
#+BEGIN_SRC elisp
(add-to-list 'default-frame-alist '(undecorated-round . t))
#+END_SRC


Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets. It is optional.
#+BEGIN_SRC elisp
(setq user-full-name "Andrea Esposito"
      user-mail-address "esposito_andrea99@hotmail.com")
(setq gnutls-min-prime-bits 512)
#+end_src

** Themes
 Doom exposes five (optional) variables for controlling fonts in Doom:

 - `doom-font' -- the primary font to use
 - `doom-variable-pitch-font' -- a non-monospace font (where applicable)
 - `doom-big-font' -- used for `doom-big-font-mode'; use this for
   presentations or streaming.
 - `doom-symbol-font' -- for symbols
 - `doom-serif-font' -- for the `fixed-pitch-serif' face

 See 'C-h v doom-font' for documentation and more examples of what they
 accept. For example:

#+BEGIN_SRC elisp
;; (setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "Fira Sans" :size 13))
#+END_SRC

 If you or Emacs can't find your font, use 'M-x describe-font' to look them
 up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to
 refresh your font settings. If Emacs still can't find your font, it likely
 wasn't installed correctly. Font issues are rarely Doom issues!

There are two ways to load a theme. Both assume the theme is installed and
available. You can either set `doom-theme' or manually load a theme with the
`load-theme' function. The default is =doom-one=.

#+begin_src elisp
(setq doom-theme 'doom-dracula)
#+end_src

This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For absolute line numbers, set this to `t'. For relative line numbers, set this to `relative'.
#+begin_src elisp
(setq display-line-numbers-type 'relative)
#+end_src

Whenever you reconfigure a package, make sure to wrap your config in an
`after!' block, otherwise Doom's defaults may override your settings. E.g.
#+BEGIN_SRC elisp :tangle no
  (after! PACKAGE
    (setq x y))
#+END_SRC
The exceptions to this rule:
  - Setting file/directory variables (like `org-directory')
  - Setting variables which explicitly tell you to set them before their
    package is loaded (see 'C-h v VARIABLE' to look up their documentation).
  - Setting doom variables (which start with 'doom-' or '+').
Here are some additional functions/macros that will help you configure Doom.
- `load!' for loading external *.el files relative to this one
- `use-package!' for configuring packages
- `after!' for running code after a package has loaded
- `add-load-path!' for adding directories to the `load-path', relative to
  this file. Emacs searches the `load-path' when you load packages with
  `require' or `use-package'.
- `map!' for binding new keys
To get information about any of these functions/macros, move the cursor over
the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
This will open documentation for it, including demos of how they are used.
Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
etc).
You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
they are implemented.

** Fix EVIL mode navigation
For some reasons, =g j=, =g k=, etc. do not work (especially in Org-Mode) due to some clash with other shortcuts, and I should use =g <up>=, =g <down>=. This is really not confortable. Instead of trying and finding /where/ the clash is, it's just easier to remap the bindings to use visual lines.
#+begin_src elisp
(map!
 :nvm "k"   #'evil-previous-visual-line
 :o   "k"   #'evil-previous-line
 :nvm "j" #'evil-next-visual-line
 :o   "j" #'evil-next-line
 :nvm "<home>" #'evil-beginning-of-visual-line
 :nvm "<end>"  #'evil-end-of-visual-line)
#+end_src
** macOS specific stuff
Nowadays I mostly use macOS. These options make Emacs work better with the typical macOS workflow. I use Mr. Yamamoto port, installed using
#+BEGIN_SRC sh :tangle no
brew tap d12frosted/emacs-plus
brew install emacs-plus
#+END_SRC

*** Using "native" full screen
By default, Emacs is set to fullscreen by simply making itself as big as possible. This doesn't really play nicely with the notch and Spaces and Mission Control. Setting the following variable to =true= will force Emacs to use native full screen by default.
#+BEGIN_SRC elisp
(setq ns-use-native-fullscreen t)
#+END_SRC
I can now use ~toggle-frame-fullscreen~ (mapped to =SPC t F=) to toggle fullscreen as a typical macOS app.

Additionally, I want to use the left "option" key as "meta" and the right one as "option" to input special characters.
#+begin_src elisp
(setq ns-alternate-modifier 'meta)
(setq ns-right-alternate-modifier 'none)
#+end_src

* Org Mode
#+begin_src elisp
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/Documents/Org")


;; Set the output theme of HTML code to CSS, thus making it dependent on the
;; actual stylesheet used.
(setq org-html-htmlize-output-type 'css)
#+END_SRC

I prefer tags to be aligned to the right.
#+BEGIN_SRC elisp
(setq fill-column 80)
(setq org-tags-column (- fill-column))
#+END_SRC

This automatically sets =.org_archive= files as =org-mode= files, regardless of the presence (or absence) of a mode line.
#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.org_archive\\'" . org-mode))
#+end_src

** Obsidian
I use =obsidian.el= to edit Obsidian.md files in Emacs. This fits in the "Org-Mode" category since in Obsidian I have an org-mode plugin so the two play nicely together.

#+begin_src elisp :tangle packages.el
(package! obsidian)
#+end_src

And I add =md-roam= (currently not available on MELPA) to make =org-roam= work also with Obsidian's markdown files.
#+begin_src elisp :tangle packages.el
(package! md-roam
  :recipe (:host github :repo "nobiot/md-roam"))
#+end_src

#+begin_src elisp
(use-package! org-roam
  :after org
  ; :config
  ; (setq org-roam-directory "/path/to/valut")
  ; (setq org-roam-dailies-directory "Journal/")
)
(use-package! md-roam
  :after org-roam
  :config
  (set-company-backend! 'markdown-mode 'company-capf) ; add company-capf as company backend in markdown buffers
  (setq org-roam-file-extensions '("org" "md")) ; enable Org-roam for a markdown files
  (md-roam-mode 1) ; md-roam-mode needs to be active before org-roam-db-sync
  (org-roam-db-autosync-mode 1)
  (add-to-list 'org-roam-capture-templates
               '("m" "Markdown" plain "" :target
                 (file+head "%<%Y-%m-%dT%H%M%S>-${slug}.md"
                            "---\ntitle: ${title}\nid: %<%Y-%m-%dT%H%M%S>\ncategory: \n---\n")
                 :unnarrowed t)))
#+end_src

** Allowing Citations
This package allows citing from BibTeX. We must install it first...
#+BEGIN_SRC elisp :tangle packages.el
(package! org-ref)
#+END_SRC
... and then require it.
#+BEGIN_SRC elisp
(require 'org-ref)
#+END_SRC

** LaTeX Export
This sets the LaTeX compiler to use latexmk and use =minted= to colorize source code listings.
#+BEGIN_SRC elisp
; (after! ox-latex
;   (setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f")))
(add-to-list 'org-latex-packages-alist '("" "minted"))
(setq org-latex-listings 'minted)
#+END_SRC

When I export to PDF from Org-Mode using LaTeX, I don't need the =.tex= file (if I need to manually inspect or edit it, I just convert to tex first and then manually compile). Furthermore, I don't want any natbib/biblatex =.bbl= files. So I tell Org-Mode that they are "temporary log files"...
#+BEGIN_SRC elisp
(after! ox-latex
    (add-to-list 'org-latex-logfiles-extensions "tex")
    (add-to-list 'org-latex-logfiles-extensions "bbl"))
#+END_SRC

*** Custom LaTeX Classes
