.config/doom/config.org
**** Personal Notes
This class is heavily inspired by O'Reilly books (requires LaTeX =.cls= file in the same directory of the =.org= file). I usually use it for personal notes (for example, I used it for writing notes during AI courses).
#+BEGIN_SRC elisp
(after! ox-latex
  (add-to-list 'org-latex-classes
               '("notes"
                 "\\documentclass{mynotes}
\\usepackage[utf8]{inputenc}
[NO-DEFAULT-PACKAGES]"
                 ("\\chapter{%s}" . "\\chapter*{%s}")
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+END_SRC
**** ACM
This class uses ACM =acmart= class (requires LaTeX =.cls= file in the same directory of the =.org= file).
#+BEGIN_SRC elisp
(after! ox-latex
  (add-to-list 'org-latex-classes
               '("acm"
                 "\\documentclass{acmart}
\\usepackage[utf8]{inputenc}
\\usepackage{graphicx}
\\usepackage{hyperref}
\\usepackage[normalem]{ulem}
\\usepackage{soul}
[NO-DEFAULT-PACKAGES]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+END_SRC
**** Springer LNCS
This class uses Springer LNCS class (requires LaTeX =.cls= file in the same directory of the =.org= file).
#+BEGIN_SRC elisp
(after! ox-latex
  (add-to-list 'org-latex-classes
               '("lncs"
                 "\\documentclass{llncs}
\\usepackage[utf8]{inputenc}
\\usepackage{graphicx}
\\usepackage{hyperref}
[NO-DEFAULT-PACKAGES]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+END_SRC
**** CEUR-WS
This class uses CEUR-WS =ceurart= class (requires LaTeX =.cls= file in the same directory of the =.org= file).
#+BEGIN_SRC elisp
(after! ox-latex
  (add-to-list 'org-latex-classes
                 '("ceurart" "\\documentclass{ceurart}
\\usepackage[utf8]{inputenc}
\\usepackage{graphicx}
\\usepackage{hyperref}
[NO-DEFAULT-PACKAGES]
\\sloppy"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+END_SRC
**** APA
This class uses APA compliant styles.
#+BEGIN_SRC elisp
(after! ox-latex
  (add-to-list 'org-latex-classes
               '("apa"
                 "\\documentclass{apa7}
\\usepackage{xcolor}
\\usepackage{amsmath,amsthm,amssymb}
\\newtheorem{definition}{Definition}
[DEFAULT-PACKAGES]
[EXTRA]
\\usepackage{cleveref}
%\\usepackage{abstract}
\\usepackage{hyperref}
\\hypersetup{colorlinks=true,allcolors=blue}
"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+END_SRC
**** CVPR
This class uses CVPR compliant styles.
#+BEGIN_SRC elisp
(after! ox-latex
  (add-to-list 'org-latex-classes
               '("cvpr"
                 "\\documentclass[10pt,twocolumn,letterpaper]{article}
\\usepackage{cvpr}
\\usepackage{times}
\\usepackage{epsfig}
\\usepackage{graphicx}
\\usepackage{amsmath}
\\usepackage{amssymb}
[NO-DEFAULT-PACKAGES]
"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+END_SRC

** Org-Mode Babel
*** Additional Languages
**** Mermaid for charts
#+BEGIN_SRC elisp :tangle packages.el
(package! ob-mermaid)
#+END_SRC

#+BEGIN_SRC elisp
(org-babel-do-load-languages
    'org-babel-load-languages
    '((mermaid . t)
      (scheme . t)
      (your-other-langs . t)))
#+END_SRC

** Org Capture Templates

I was fine with Doom Emacs' default templates, until I was not. I liked the overall settings, but I did not find confortable to use different files that all behave like an inbox, and it felt "wrong" to mix unprocessed inbox elements with processed tasks (e.g., in the =projects.org= file). Here I try to set everything up using only a single file =inbox.org=.

For this purpose, we start by defining a "common inbox" file name (this is used to simplify any editing if I need it in the future).
#+BEGIN_SRC elisp
(setq +org-capture-common-inbox-file "~/Documents/Org/inbox.org")
#+END_SRC

We then assign all Doom Emacs' =org-capture= variables the value of the common inbox file name.
#+BEGIN_SRC elisp
(setq +org-capture-todo-file +org-capture-common-inbox-file)
(setq +org-capture-changelog-file +org-capture-common-inbox-file)
(setq +org-capture-notes-file +org-capture-common-inbox-file)
;; I like the journal file to be kept separate
;; (setq +org-capture-journal-file +org-capture-common-inbox-file)
(setq +org-capture-projects-file +org-capture-common-inbox-file)
(setq +org-capture-emails-file +org-capture-common-inbox-file)
#+END_SRC
** Writing Letters
#+BEGIN_SRC elisp :tangle packages.el
(package! ox-koma-letter :recipe
  (:host github
   :repo "bzg/org-mode"
   :files ("lisp/ox-koma-letter.el")))
#+END_SRC

#+BEGIN_SRC elisp
(eval-after-load 'ox '(require 'ox-koma-letter))
#+END_SRC

** Custom TOOD states
*** Workflow for papers and articles

Here I define a new workflow for a "PAPER" that should follow this pipeline:
1. When the paper is ideated or assigned, it is noted as PAPER
2. When started working on it, it is in WRITING
3. When the paper is ready and is sent for review, it is INREVIEW
4. When the paper is got back from reviews:
   1. If the paper is being rejected it goes into REJECTED
   2. If edits are required, it goes to TOEDIT
      1. Once ready and sent out again, it gets back to INREVIEW
   3. If the paper is accepted, it is marked as ACCEPTED
      1. Once proof are ready and are received and must be checked, it becomes PROOF
      2. Once proof are sent out it becomes INPRESS
      3. One published it becomes PUBLISHED
#+BEGIN_SRC elisp 
(add-to-list 'org-todo-keywords
        '(sequence
           "PAPER(P)"  ; A paper, which is in itself a type of project
           "WRITING(W)"  ; The paper has been started
           "INREVIEW(R)"  ; The paper was sent for review and we are waiting for reviews
           "TOEDIT(E)"  ; The paper was received back from review and edits should be made
           "ACCEPTED(A)"  ; The paper was accepted
           "PROOF(I)"  ; Proofs need to be checked
           "INPRESS(S)"  ; Proofs were checked and the paper is now in press
           "|"
           "REJECTED(K)"  ; The paper was rejected
           "PUBLISHED(D") ; The paper was accepted and is now published
        t
          )
#+END_SRC

We can now color-code the various keywords...
#+BEGIN_SRC elisp
(add-to-list 'org-todo-keyword-faces '("WRITING" . +org-todo-active))
(add-to-list 'org-todo-keyword-faces '("INREVIEW"  . +org-todo-onhold))
(add-to-list 'org-todo-keyword-faces '("ACCEPTED" . +org-todo-onhold))
(add-to-list 'org-todo-keyword-faces '("INPRESS" . +org-todo-onhold))
(add-to-list 'org-todo-keyword-faces '("PAPER" . +org-todo-project))
(add-to-list 'org-todo-keyword-faces '("REJECTED"   . +org-todo-cancel))
#+END_SRC
** System-Wide Org Capture
Code from: https://macowners.club/posts/org-capture-from-everywhere-macos/#default-org-capture

#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! noflet)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
(defun timu-func-make-capture-frame ()
  "Create a new frame and run `org-capture'."
  (interactive)
  (unless (server-running-p)
    (server-start))
  (require 'noflet)
  (make-frame '((name . "capture")
                (t . 80)
                (height . 25)))
  (select-frame-by-name "capture")
  (delete-other-windows)
  (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
    (org-capture)))

(defadvice org-capture-finalize
    (after delete-capture-frame activate)
  "Advise capture-finalize to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))

(defadvice org-capture-destroy
    (after delete-capture-frame activate)
  "Advise capture-destroy to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))
#+end_src

#+RESULTS:
: org-capture-destroy

* Additional Stuff
#+BEGIN_SRC elisp
(display-battery-mode t)
(setq display-time-string-forms '(year "." month "." day " " 24-hours ":" minutes))
(display-time)
#+END_src

* Mail (mu4e)
#+begin_src elisp
(after! mu4e
  (setq sendmail-program (executable-find "msmtp")
        send-mail-function #'smtpmail-send-it
        message-sendmail-f-is-evil t
        message-sendmail-extra-arguments '("--read-envelope-from")
        message-send-mail-function #'message-send-mail-with-sendmail))
#+end_src
#+BEGIN_SRC elisp
(after! mu4e
(setq mu4e-compose-format-flowed t)
;; (remove-hook! 'mu4e-compose-pre-hook #'org-msg-mode)
;; (add-hook! 'mu4e-compose-mode-hook #'message-mode)
;; (setq mm-sign-option 'guided)
;; (setq mu4e-sent-messages-behavior (lambda ()
                                    ;; (if (string= (message-sendmail-envelope-from) "a.esposito39@studenti.uniba.it")
                                        ;; 'delete 'sent)))
;; (add-hook! 'mu4e-compose-mode-hook #'turn-on-auto-fill)

(setq mu4e-headers-date-format "%+4Y-%m-%d")
(with-eval-after-load 'mm-decode
    (add-to-list 'mm-discouraged-alternatives "text/html"))
(setq mu4e-view-html-plaintext-ratio-heuristic most-positive-fixnum)
(setq mu4e-context-policy 'always-ask)
;; (add-hook 'mu4e-compose-mode-hook 'flyspell-mode)
(setq mu4e-maildir-shortcuts '(("/uniba/Inbox" . ?u)
                               ("/hotmail/Inbox" . ?h)
                               ))
                               ;; ("/studentiuniba/Inbox" . ?s)
(setq mu4e-compose-format-flowed t)
(add-to-list 'mu4e-bookmarks
               '(:name "All Inboxes" :query "m:/hotmail/Inbox or m:/uniba/Inbox" :key ?i))

(add-to-list 'display-buffer-alist
             `(,(regexp-quote mu4e-main-buffer-name)
               display-buffer-same-window))
)
#+END_SRC

** Using Org-Mode
#+BEGIN_SRC elisp :tangle packages.el
(package! org-mime)
;; (package! org-msg :disable t)
;; (package! org-msg)
#+END_SRC

#+BEGIN_SRC elisp
(use-package org-mime
  :ensure t)

(setq org-mime-export-options '(:with-toc nil))
#+END_SRC

** Accounts Setup
