.config/doom/config.org
*** Personal Account (Hotmail/Outlook)
#+BEGIN_SRC elisp
(set-email-account! "Hotmail"
  '((mu4e-sent-folder       . "/hotmail/Sent")
    (mu4e-drafts-folder     . "/hotmail/Drafts")
    (mu4e-trash-folder      . "/hotmail/Deleted")
    (mu4e-refile-folder     . "/hotmail/Archive")
    ; (mu4e-get-mail-command  . "mbsync -a")
    (mu4e-update-interval   . 60)
    (smtpmail-smtp-user     . "esposito_andrea99@hotmail.com")
    (user-mail-address      . "esposito_andrea99@hotmail.com")    ;; only needed for mu < 1.4
    (smtpmail-stream-type   . starttls)
    (smtpmail-smtp-server . "smtp.office365.com")
    (smtpmail-smtp-service . 587)
    (mu4e-compose-signature . (concat "Andrea Esposito, Ph.D.\n"
                                      "Research Fellow (he/him/his)\n"
                                      "\n"
                                      "University of Bari Aldo Moro\n"
                                      "Department of Computer Science\n"
                                      "I.V.U. Laboratory\n"
                                      "Via E. Orabona 4, 70125 Bari, Italy (4th floor)\n"
                                      "\n"
                                      "eMail: andrea.esposito@uniba.it\n"
                                      "Web: https://espositoandrea.github.io\n"
                                      "ORCID: 0000-0002-9536-3087\n"
                                      "Tel.: +39 080 5442461\n" )))
  t)
#+END_SRC
*** Work Account (University of Bari)
#+BEGIN_SRC elisp
(set-email-account! "UniBa"
  '((mu4e-sent-folder       . "/uniba/Sent")
    (mu4e-drafts-folder     . "/uniba/Drafts")
    (mu4e-trash-folder      . "/uniba/Trash")
    (mu4e-refile-folder     . "/uniba/Archive")
    ;; (mu4e-get-mail-command  . "mbsync -a")
    (mu4e-update-interval   . 60)
    (smtpmail-smtp-user     . "andrea.esposito")
    (user-mail-address      . "andrea.esposito@uniba.it")    ;; only needed for mu < 1.4
    (smtpmail-stream-type   . starttls)
    (smtpmail-smtp-server . "smtp.uniba.it")
    (smtpmail-smtp-service . 587)
    (mu4e-compose-signature . (concat "Andrea Esposito, Ph.D.\n"
                                      "Research Fellow (he/him/his)\n"
                                      "\n"
                                      "University of Bari Aldo Moro\n"
                                      "Department of Computer Science\n"
                                      "I.V.U. Laboratory\n"
                                      "Via E. Orabona 4, 70125 Bari, Italy (4th floor)\n"
                                      "\n"
                                      "eMail: andrea.esposito@uniba.it\n"
                                      "Web: https://espositoandrea.github.io\n"
                                      "ORCID: 0000-0002-9536-3087\n"
                                      "Tel.: +39 080 5442461\n" )))
  t)
#+END_SRC

*** University Account (Student) [OLD]
#+BEGIN_SRC elisp :tangle no
(set-email-account! "Studenti UniBa"
  '((mu4e-trash-folder      . "/studentiuniba/[Gmail]/Cestino")
    (mu4e-refile-folder     . "/studentiuniba/[Gmail]/Archivio")
    (mu4e-drafts-folder     . "/studentiuniba/[Gmail]/Bozze")
    (mu4e-sent-folder       . "/studentiuniba/[Gmail]/Posta inviata")
    (mu4e-get-mail-command  . "mbsync -a")
    (mu4e-update-interval   . 60)
    (smtpmail-smtp-user     . "a.esposito39@studenti.uniba.it")
    (user-mail-address      . "a.esposito39@studenti.uniba.it")    ;; only needed for mu < 1.4
    (smtpmail-stream-type   . starttls)
    (smtpmail-smtp-server . "smtp.gmail.com")
    (smtpmail-smtp-service . 587)
    (mu4e-compose-signature . (concat "Andrea Esposito, Ph.D.\n"
                                      "Master’s student in Computer Science\n"
                                      "\n"
                                      "University of Bari “Aldo Moro”\n"
                                      "Department of Computer Science\n"
                                      "Degree Course in Computer Science\n"
                                      "\n"
                                      "Student ID: 735116\n"
                                      "ORCID: 0000-0002-9536-3087\n"
                                      "Personal Home Page: https://espositoandrea.github.io/")))
  t)

#+END_SRC

* Telegram
The Telegram config is currently /disabled/ since I don't need it for now...
To use it, one should first install this package:
#+BEGIN_SRC elisp :tangle no
(package! telega)
#+END_SRC

This is my configuration.
#+BEGIN_SRC elisp :tangle no
(defun my-telega-chat-mode ()
  (set (make-local-variable 'company-backends)
       (append (list 'telega-company-emoji
                   'telega-company-username
                   'telega-company-botcmd
                   'telega-company-hashtag)
             (when (telega-chat-bot-p telega-chatbuf--chat)
               '(telega-company-botcmd))))
  (company-mode 1))

(add-hook 'telega-chat-mode-hook 'my-telega-chat-mode)

(setq telega-use-images t
      telega-emoji-font-family "Ubuntu")
(telega-notifications-mode 1)
(add-to-list 'evil-emacs-state-modes 'telega-chat-mode)
(add-hook 'telega-chat-mode-hook
  (lambda ()
   (local-set-key (kbd "C-c q") 'telega)))

(map! :leader :desc "Open Telegram client" "o t" #'telega)
(require 'company-posframe)
(company-posframe-mode 1)

(map! :leader :desc "Open Telegram client" "o t" #'telega)
#+end_src

* Olivetti mode
#+BEGIN_SRC elisp :tangle packages.el
(package! olivetti)
#+END_SRC

#+BEGIN_SRC elisp
(map! :leader :desc "Toggle Olivetti mode" "t o"  #'olivetti-mode)
#+END_SRC

* Screenwriting (=fountain-mode=)
I do not typically screenwrite. However, sometimes it is useful to typeset something so that it /looks like/ a script. As an example, I often find myself transcribing interviews for research purposes and later analysis: typesetting it as a script allows for a "pleasurable" on-paper analysis, while using a "standard" markup language allows to easily parse it for usage in code.

A markup language for screenwriters if [[https://fountain.io][Fountain]].  To use within Emacs, one must install =fountain-mode=.

#+BEGIN_SRC elisp :tangle packages.el
(package! fountain-mode)
#+END_SRC

I can then simplify exporting to other formats by defining some mode-specific key bindings to be used instead of =C-c= stuff (I always forget those).

#+BEGIN_SRC elisp
(map! :after fountain-mode
      :map fountain-mode-map
      :localleader
      :prefix ("e" . "export")

      :desc "Export Fountain file"
      "e" #'fountain-export-command)
(map! :after fountain-mode
      :map fountain-mode-map
      :localleader
      :prefix ("e" . "export")

      :desc "Export to PDF using Troff"
      "t" #'fountain-export-troff)
#+END_SRC

* LaTeX
This line fixes an issue with Emacs < 30 that prevented AucTeX from working correctly with Doom Emacs. I have no idea about why, but this solution came up [[https://discourse.doomemacs.org/t/auctex-and-latex-mode/4901/3][online]]...
#+begin_src emacs-lisp :tangle yes
(setq major-mode-remap-alist major-mode-remap-defaults)
#+end_src

* Python
** Ruff and Ruff Language Server
#+begin_src elisp
(add-hook 'python-mode-hook 'eglot-ensure)
(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs
               '(python-mode . ("ruff" "server")))
  (add-hook 'after-save-hook 'eglot-format))
#+end_src

* RSS Reader
#+BEGIN_SRC elisp :tangle packages.el
(package! elfeed)
(package! elfeed-goodies)
(package! elfeed-org)
(package! elfeed-tube)
(package! elfeed-tube-mpv)
#+END_SRC

#+BEGIN_SRC elisp
(require 'elfeed-goodies)
(elfeed-goodies/setup)
(require 'elfeed-org)
(elfeed-org)
(add-hook! 'elfeed-search-mode-hook #'elfeed-update)
#+END_SRC

#+BEGIN_SRC elisp
(use-package! elfeed
  :commands elfeed
  :init
  (map! :leader
    (:prefix ("o" . "open")
      :desc "Open elfeed" "e" #'elfeed)))
(after! elfeed
  (map! :map elfeed-search-mode-map
        :localleader
        :desc "Elfeed update" "r" #'elfeed-update))
(use-package! elfeed-web
    :defer t
    :commands elfeed-web-stop)

(map! :after elfeed-search
      :map elfeed-search-mode-map
      [remap kill-this-buffer] "q"
    [remap kill-buffer] "q"
    :n "q" #'elfeed-kill-buffer
)
#+END_SRC

* Accounting Software
To manage my money, I use =hledger=. To edit the journal file without leaving Emacs, I use =ledger-mode= (I prefer it to =hledger-mode=).

I leverage the script provided in the [[https://hledger.org/editors.html#hledger-mode][=hledger= documentation]] to fully make this functional.

#+begin_src shell :tangle hledger.sh :shebang "#!/bin/sh"
# hledger.sh
# Kudos to acarrico for the original script.

# The script is contingent on ledger-default-date-string
# being set to "%Y-%m-%d", aka ISO date format.

iargs=("$@")
oargs=()
j=0;
date=;
for((i=0; i<${#iargs[@]}; ++i)); do
    case ${iargs[i]} in
        --date-format)
            # drop --date-format and the next arg
            i=$((i+1));
            ;;
        cleared) # for ledger-di
            splay-balance-at-point
            # convert "cleared" to "balance -N -C"
            oargs[j]=balance; oargs[j+1]=-N; oargs[j+2]=-C; j=$((j+3));
            ;;
        xact)
            # convert "xact" to "print --match"
            oargs[j]=print; oargs[j+1]=--match; j=$((j+2));
            # drop xact argument and stash the date argument
            i=$((i+1));
            date=${iargs[i]};
            ;;
        # NOTE: Reconciliation still doesn't work for other reasons
        #       so the following filters/conversions are unnecessary for now.
        # --sort) # for reconcilliation
        #     # drop --sort and the next arg
        #     i=$((i+1));
        #     ;;
        # --uncleared) # for reconcilliation
        #     # convert "--uncleared" to "--unmarked --pending"
        #     oargs[j]=--unmarked; oargs[j+1]=--pending; j=$((j+2))
        #     ;;
        *)
            # keep any other args:
            oargs[j]=${iargs[i]};
            j=$((j+1));
            ;;
    esac
done

if test "$date"
then
    # substitute the given date for the old date:
    hledger "${oargs[@]}" | sed "1s/....-..-../$date/"
else
    # echo "${oargs[@]}"
    hledger "${oargs[@]}"
fi
#+end_src


#+begin_src sh
realpath hledger.sh
#+end_src

#+NAME: hledger-script-file-path
#+RESULTS:
: /Users/andreaesposito/.config/doom/hledger.sh


To make =ledger-mode= compatible with =hledger= I need to change the default date format.

#+begin_src elisp :var hledger_script_path=hledger-script-file-path
(use-package! ledger-mode
  :custom
  ((ledger-binary-path "hledger")
   (ledger-mode-should-check-version nil)
   (ledger-report-auto-width nil)
   (ledger-report-links-in-register nil)
   (ledger-report-native-highlighting-arguments '("--color=always")))
  :mode ("\\.hledger\\.journal\\'" . ledger-mode))
(setq ledger-default-date-format "%Y-%m-%d")
(setq ledger-binary-path hledger_script_path)
#+end_src
